// Task_2.cpp : Defines the entry point for the console application.
//

#include "stdafx.h"
#include "Pair.h"

int main()
{
	Pair<int, char> p1{1,'c' };
    return 0;
}

/*
Задача 2. Да се реализира шаблонен клас Pair с два типови параметъра, който
представлява двойка от ключ и стойност. Клас Pair трябва да поддържа следната
функционалност:
● Оператор == за ставняване на две двойки
● Метод getValue който приема ключ и връща стойността само ако полученият
като аргумент ключ съвпада.
Да се реализира клас Dictionary, който представлява речник представен като масив от
двойки с фиксирана дължина. За речника да се реализират следните методи:
● Метод за добавяне на двойка в речника.
● Метод, който приема двойка и я премахва от речника.
● Метод за намиране на стойност в речника по даден ключ.*/
